backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape:
      - null
      - 3
      dtype: float32
      name: dense_input
      ragged: false
      sparse: false
    module: keras.layers
    registered_name: null
  - build_config:
      input_shape:
      - null
      - 3
    class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      batch_input_shape:
      - null
      - 3
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
        module: keras.initializers
        registered_name: null
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
        module: keras.initializers
        registered_name: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 64
      use_bias: true
    module: keras.layers
    registered_name: null
  - build_config:
      input_shape:
      - null
      - 64
    class_name: Dropout
    config:
      dtype: float32
      name: dropout
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    module: keras.layers
    registered_name: null
  - build_config:
      input_shape:
      - null
      - 64
    class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
        module: keras.initializers
        registered_name: null
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
        module: keras.initializers
        registered_name: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 128
      use_bias: true
    module: keras.layers
    registered_name: null
  - build_config:
      input_shape:
      - null
      - 128
    class_name: Dropout
    config:
      dtype: float32
      name: dropout_1
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    module: keras.layers
    registered_name: null
  - build_config:
      input_shape:
      - null
      - 128
    class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
        module: keras.initializers
        registered_name: null
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
        module: keras.initializers
        registered_name: null
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 64
      use_bias: true
    module: keras.layers
    registered_name: null
  - build_config:
      input_shape:
      - null
      - 64
    class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
        module: keras.initializers
        registered_name: null
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
        module: keras.initializers
        registered_name: null
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 1
      use_bias: true
    module: keras.layers
    registered_name: null
  name: sequential
keras_version: 2.15.0
